# -*- coding: utf-8 -*-
from transformers import AutoModelForQuestionAnswering,AutoTokenizer,pipeline
from fastapi import FastAPI
from typing import Optional

model_names = [
        #'hfl/chinese-pert-large',
        #'hfl/chinese-pert-base',
        #'hfl/chinese-roberta-wwm-ext-large',
        #'hfl/chinese-roberta-wwm-ext',
        #'hfl/chinese-bert-wwm-ext',
        #'hfl/chinese-bert-wwm',
        #'hfl/rbt3',
        #'hfl/rbtl3',
        'uer/roberta-base-chinese-extractive-qa',
        'luhua/chinese_pretrain_mrc_roberta_wwm_ext_large',
        'luhua/chinese_pretrain_mrc_macbert_large',
        'wptoux/albert-chinese-large-qa',
        # 'yechen/question-answering-chinese',
        # 'liam168/qa-roberta-base-chinese-extractive'
        ]

def test_a_model(model_name):
    model = AutoModelForQuestionAnswering.from_pretrained(model_name)
    tokenizer = AutoTokenizer.from_pretrained(model_name)
    QA = pipeline('question-answering', model=model, tokenizer=tokenizer, device=0)

    # context = "普希金从那里学习人民的语言，吸取了许多有益的养料，这一切对普希金后来的创作产生了很大的影响。这两年里，" \
    #           "普希金创作了不少优秀的作品，如《囚徒》、《致大海》、《致凯恩》和《假如生活欺骗了你》等几十首抒情诗，叙事诗《努林伯爵》，" \
    #           "历史剧《鲍里斯·戈都诺夫》，以及《叶甫盖尼·奥涅金》前六章。 "
    # QA_input = {
    #     'question': "著名诗歌《假如生活欺骗了你》的作者是",
    #     'context': context
    # }
    # QA_input2 = {
    #     'question': "《假如生活欺骗了你》的作者是",
    #     'context': context
    # }
    #
    # print(QA(QA_input))
    # print(QA(QA_input2))

    context = "公诉机关江苏省连云港市海州区人民检察院。被告人陶某某，男，1994年11月2日出生，公民身份证号码3708261994********，汉族，" \
              "初中文化，无业，户籍所在地及住址均为山东省济宁市微山县夏镇东薛庄繁荣街11号。因涉嫌诈骗罪，于2021年5月26日被刑事拘留，" \
              "同年7月1日被逮捕。现羁押于连云港市看守所。" \
              "指派辩护人葛元建，江苏新海连律师事务所律师。江苏省连云港市海州区人民检察院以海检刑诉[2021]200号起诉书指控被告人陶某某犯诈骗罪，" \
              "于2021年10月9日向本院提起公诉，本院依法组成合议庭，适用普通程序于2021年12月3日公开开庭审理了本案。" \
              "连云港市海州区人民检察院指派检察员周金建依法出庭支持公诉，被告人陶某某及其辩护人葛元建到庭参加诉讼。" \
              "现已审理终结。江苏省连云港市海州区人民检察院指控: " \
              "2021年4月份以来，" \
              "被告人陶某某以注册保健品会员等名义，骗取戴金凤、刘连成等人的身份信息注册支付宝账号，" \
              "并利用上述支付宝账户注册多个咸鱼账号。" \
              "被告人陶某某在连云港市海州区民主西路“顺泰”旅馆多次在上述咸鱼账户周某布虚假的三亚艾迪逊、希尔顿等酒店代订优惠信息，" \
              "被害人在咸鱼平台下单后，陶某某使用被害人的身份信息到酒店预订房间但不付款，随后向被害人谎称已订购好酒店，" \
              "诱导被害人确认收货，被害人支付到咸鱼平台上的资金被转到陶某某控制的支付宝账户内，从而被骗。经审查，" \
              "2021年4月至5月期间，被告人陶某某利用上述方式先后诈骗黄海涛、周然等被害人50余人，诈骗金额人民币共计约18万元，" \
              "该款项被陶某某用于赌博、个人日常支出等。" \
              "为证实上述指控，公诉机关向法庭提交了相关书证、证人证言、被害人陈述、被告人供述和辩解、辨认、提取笔录以及电子数据等证据。" \
              "公诉机关认为，被告人陶某某以非法占有为目的，骗取他人财物，数额巨大，应当以诈骗罪追究其刑事责任。" \
              "被告人陶某某归案后如实供述自己的罪行，可以从轻处罚。被告人陶某某自愿认罪认罚，可以从宽处理。" \
              "建议对被告人陶某某以诈骗罪判处有期徒刑四年，并处罚金。被告人陶某某对起诉书指控的犯罪事实及罪名均无异议，" \
              "当庭表示自愿认罪认罚。被告人陶某某的辩护人提出如下辩护意见:1.陶某某系坦白、认罪认罚，可以从轻、从宽处罚;" \
              "2.陶某某一贯表现良好，无前科劣迹，希望对其从宽处理。经审理查明:2021年4月份以来，被告人陶某某以注册保健品会员等名义，" \
              "骗取戴金凤、刘连成等人的身份信息注册支付宝账号，并利用上述支付宝账户注册多个咸鱼账号。" \
              "被告人陶某某在连云港市海州区民主西路“顺泰”旅馆多次在上述咸鱼账户周某布虚假的三亚艾迪逊、" \
              "希尔顿等酒店代订优惠信息，被害人在咸鱼平台下单后，陶某某使用被害人的身份信息到酒店预订房间但不付款，" \
              "随后向被害人谎称已订购好酒店，诱导被害人确认收货，被害人支付到咸鱼平台上的资金被转到陶某某控制的支付宝账户内，" \
              "从而被骗。经审查，2021年4月至5月期间，被告人陶某某利用上述方式先后诈骗黄海涛、周然周某害人47人，" \
              "诈骗金额共计人民币175350元，该款项被陶某某用于赌博、个人日常支出等。  上述事实，被告人陶某某在庭审中亦无异议，" \
              "且有经法庭举证、质证的常住人又基本信息、受案登记表、立案决定书、发破案经过、到案经过、支付宝交易流水、情况说明等书证，" \
              "未出庭证人刘连成、张朝阳、尚彦亮证言，被害人蒋叶、闫坤、肖栋、董岩、周然、舒畅、王诗雨、陆颖、杨旭、陈莹等人陈述，" \
              "被告人陶某某供述和辩解以及辨认、提取笔录等证据证实，本院予以确认。  关于辩护人提出的辩护意见，经查证属实，本院依法予以采纳。" \
              "本院认为，被告人陶某某以非法占有为目的，骗取他人财物，数额巨大，其行为已构成诈骗罪，应当依法追究其刑事责任。" \
              "连云港市海州区人民检察院指控被告人陶某某犯诈骗罪的事实清楚，证据确实、充分，指控的罪名正确，依法予以支持。" \
              "被告人陶某某归案后如实供述自己的罪行，可以从轻处罚。被告人陶某某因诈骗给被害人造成的损失，依法责令退赔。" \
              "被告人陶某某自愿认罪认罚，可以从宽处理。综上，" \
              "依据《中华人民共和国刑法》第二百六十六条，第六十七条第三款，第六十四条，《中华人民共和国刑事诉讼法》第十五条之规定，" \
              "判决如下:  一、被告人陶某某犯诈骗罪，判处有期徒刑四年，并处罚金人民币六万元。(刑期从判决执行之日起计算，判决执行以前先行羁押的，" \
              "羁押一日折抵刑期一日，即刑期自2021年5月26日起至2025年5月25日止。罚金于本判决生效后十日内一次性向本院缴纳。) " \
              " 二、责令被告人陶某某于本判决生效后十日内退赔被害人损失(详见附表)。  如不服本判决，可在接到判决书的第二日起十日内，" \
              "通过本院或者直接向江苏省连云港市中级人民法院提出上诉。书面上诉的，应当提交上诉状正本一份，副本二份。";

    questions = [
        "被告人是",
        "依据是",
        "规定是",
        "判决依据是",
        "判决依据什么法律",
        "依据几条",
        "依据《中华人民共和国刑法》哪几条",
        "依据《中华人民共和国刑法》第几条",
        "判处犯罪是",
        "判处徒刑几年"
    ]

    for question in questions:
        QA_input = {
            'question': question,
            'context': context
        }

        print(question)
        print(QA(QA_input))

for model_name in model_names:
    print("")
    print("model:", model_name)
    print("")
    test_a_model(model_name)

